:PROPERTIES:
:year:     2025
:created:  2025-06-04 03:41
:version:  0.1
:url:      https://github.com/li-yiyang/func2exec
:keywords: Image dump
:compability: SBCL Only
:END:
#+title: [func2exec]: Turn your lisp function to executable
#+author: 凉凉
*** Help Flag
Print help message with =--help= flag:

#+name: jscl-builder.test
#+header: :dir build
#+header: :results output
#+begin_src sh
  ./jscl-build --help
#+end_src

#+RESULTS: jscl-builder.test
#+begin_example
jscl-build output ...

  output   [PLAIN]

Build Lisp scripts `files' as `output'.

Parameters:
+ `output': the output JS files
+ `files':  the Lisp files

Note:
due to the JSCL feature, all the files should be placed
within a same directory.

Example:

    (jscl-build "foo.js" "foo1.lisp" "foo2.lisp")

Input:
  :help t
#+end_example

The =--help= flag will print the parsed input for debug usage:

#+name: jscl-builder.test.help
#+header: :dir build
#+header: :results output
#+begin_src sh
  ./jscl-build --help foo.js foo.lisp
#+end_src

#+RESULTS: jscl-builder.test.help
#+begin_example
jscl-build output ...

  output   [PLAIN]

Build Lisp scripts `files' as `output'.

Parameters:
+ `output': the output JS files
+ `files':  the Lisp files

Note:
due to the JSCL feature, all the files should be placed
within a same directory.

Example:

    (jscl-build "foo.js" "foo1.lisp" "foo2.lisp")

Input:
  "foo.js" "foo.lisp" :help t
#+end_example

*** Here it goes
Assuming having the lisp script to be compiled by JSCL compiler:

#+name: jscl.foo.lisp
#+header: :tangle build/foo.lisp
#+begin_src lisp
  (defun sum (&rest args) (reduce #'+ args))
#+end_src

Then using the built =jscl-build= executable:

#+name: jscl-builder.test.build
#+header: :dir build
#+header: :results verbatim
#+begin_src sh
  ./jscl-build foo.js foo.lisp && head foo.js
#+end_src

#+RESULTS: jscl-builder.test.build
#+begin_example
Compiling foo.lisp...
(function(jscl){
'use strict';
(function(values, internals){
var l1=internals.intern('SUM','COMMON-LISP-USER');
var l2=internals.intern('NIL','COMMON-LISP');
var l3=internals.intern('+','COMMON-LISP');
var l4=internals.intern('REDUCE','COMMON-LISP');
l1.fvalue=(function(){var FUNC=(function JSCL_USER_SUM(values){var v1=l2.value;
var I;
for (I=arguments.length-1-1;I>=0;I--)v1=new internals.Cons(arguments[I+1],v1);
#+end_example

Lucky, :).



*** Header
#+name: header
#+header: :var file="src.lisp" desc="A function"
#+header: :var year=property(p="year")
#+header: :var created=property(p="created")
#+header: :var version=property(p="version")
#+header: :var url=property(p="url")
#+header: :var keywords=property(p="keywords")
#+header: :var compatibility=property(p="compatibility")
#+header: :var year-now=(format-time-string "%Y")
#+header: :var update=(format-time-string "%Y-%m-%d %H:%M")
#+header: :var license=license
#+header: :cache yes
#+begin_src emacs-lisp
  (concat (format ";;; %s --- %s\n\n" file desc)
          (format ";; File:        %s\n" file)
          (format ";; Description: %s\n" desc)
                  ";; Author:      凉凉\n"
                  ";; Maintainer:  凉凉\n"
          (format ";; Copyright (c) %s, 凉凉, all rights reserved\n"
                  (if (string= year year-now)
                      (format "%s" year)
                    (format "%s-%s" year year-now)))
          (format ";; Created: %s\n" created)
          (format ";; Version: %s\n" version)
          (format ";; Last-Updated: %s\n" update)
                  ";;           By: 凉凉\n"
          (format ";; URL: %s\n" url)
          (format ";; Keywords: %s\n" keywords)
          (format ";; Compatibility: %s\n" compatibility)
                  ";; \n"
                  ";; \n\n"
                  ";;; License\n"
                  ";; \n"
          (string-join
           (mapcar (lambda (line) (format ";; %s" line))
                   (split-string license "\n"))
           "\n"))
#+end_src

#+RESULTS[0476dd2dfe8adc9e29af10b462024aa4629a7752]: header
#+begin_example
;;; src.lisp --- A function

;; File:        src.lisp
;; Description: A function
;; Author:      凉凉
;; Maintainer:  凉凉
;; Copyright (c) 2025, 凉凉, all rights reserved
;; Created: 2025-06-04 03:41
;; Version: 0.1
;; Last-Updated: 2025-06-04 05:29
;;           By: 凉凉
;; URL: https://li-yiyang.github.io
;; Keywords:
;; Compatibility:
;;
;;

;;; License
;;
;; this package is free software: you can redistribute it and/or modify
;; it under the terms of the GNU General Public License as published
;; by the Free Software Foundation, either version 3 of the License,
;; or (at your option) any later version.
;;
;; this package is distributed in the hope that it will be useful, but
;; WITHOUT ANY WARRANTY; without even the implied warranty of
;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU
;; General Public License for more details.
;;
;; You should have received a copy of the GNU General Public License
;; along with this package. If not, see <https://www.gnu.org/licenses/>.
;;
#+end_example

*** Ending
#+name: ending
#+header: :var file="src.lisp"
#+begin_src emacs-lisp
  (format ";;; %s ends here" file)
#+end_src

#+RESULTS: ending
: ;;; src.lisp ends here

